{
    "Title": "Every franchise's biggest what-if?",
    "URL": "https://www.reddit.com/r/nbadiscussion/comments/17eq1fa/every_franchises_biggest_whatif/",
    "Author": "Nidaime33",
    "Upvotes": 193,
    "Content": " If you had to narrow it down to one what-if per franchise, which one makes the cut?\n\nI'll give examples using the team I support (the Celtics):\n\nInjuries - KG's injury in 2009. The Celtics had a scorching start to the season, but lost in 7 to the Magic. KG's absence let Dwight loose on the boards, &amp; the next year when they did make the finals the Big Ticket had clearly lost a step.\n\nDeaths - Len Bias in 1986. Red Auerbach had drafted a potentially transcendent player to back-up the greatest frontcourt in the history of professional basketball. Instead, a cocaine overdose killed him hours after being drafted No. 2.\n\nDraft Picks - Kedrick Brown in 2001. Know who the Celtics had wanted to draft? Tony Parker. Unfortunately then-GM Chris Wallace was overruled by Celtics patriarch Red Auerbach.\n\nSuspensions - Ime Udoka in 2022. Just months after taking the Celtics to the NBA finals, the former Spurs assistant was suspended for inappopriate relations with a female employee.\n\nMade/missed shots - Artest's 3-pointer in 2010. I will always believe we'd have stolen that game if ~~Ron Artest~~ Metta World Peace doesn't drive that dagger through our hearts.",
    "Top Comments": [
        "The Heat losing Mourning's prime years due to his Kidney, and Chris Bosh having to retire immediately after us signing him to a max contract.",
        "Charlotte has had the #2 pick in these years:\n\n\n1992: First pick - Shaq\n\n2004: First pick - Dwight Howard\n\n2012: First pick - Anthony Davis\n\n2023: First pick - Wemby\n\nGetting the first instead of second pick any of these drafts would have dramatically altered the Franchise",
        "The C’s almost drafted Kobe, it’s who Auerbach wanted but got overruled. \n\nAlso Bird’s injury is probably the biggest what if for the Celts.",
        "What if the Detroit Pistons would have drafted Carmelo Anthony instead of Darko Miličić with the No. 2 pick in the 2003 draft?"
    ]
}